---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.OffsetFaceFailed
source: html/a20856c7-3554-849f-433f-4fbec83e4446.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.OffsetFaceFailed Property

Failed to offset the face.

## Syntax (C#)
```csharp
public static FailureDefinitionId OffsetFaceFailed { get; }
```